# внешние пакеты
from psycopg import connect
# стандартная библиотека
from json import loads as json_loads
from pprint import pprint
from pathlib import Path
from sys import path
# текущий проект
import queries


config_path = Path(path[0]) / 'config_psql.json'
config = json_loads(config_path.read_text())

connection = connect(**config)

with connection.cursor() as cursor:
    cursor.execute(queries.sel_doctors_avg_salary)
    doctors_avg_salary = cursor.fetchall()
    
    cursor.execute(queries.sel_deps_wards_cnt)
    deps_wards_cnt = cursor.fetchall()
    
    cursor.execute(queries.sel_deps_wards_names)
    deps_wards_names = cursor.fetchall()
    
    cursor.execute(queries.sel_donations_for_deps)
    donations_for_deps = cursor.fetchall()
    
    cursor.execute(queries.sel_donations_for_deps_years)
    donations_for_deps_years = cursor.fetchall()
    
    cursor.execute(queries.sel_vacation_days_by_weeks)
    vacation_days_by_weeks = cursor.fetchall()


# >>> doctors_avg_salary
# [(Decimal('56800'),)]

# >>> pprint(deps_wards_cnt)
# [('Неврологическое отделение', 4),
#  ('Кардиологическое отделение', 4),
#  ('Физиотерапевтическое отделение', 3),
#  ('Отделение общей терапии', 3),
#  ('Отделение функциональной диагностики', 3),
#  ('Реанимация и интенсивная терапия', 3),
#  ('Токсикологическое отделение', 2)]

# >>> pprint(deps_wards_names)
# [('Кардиологическое отделение', 'КО-3, КО-2, КО-4, КО-1'),
#  ('Неврологическое отделение', 'НО-3, НО-1, НО-2, НО-4'),
#  ('Отделение общей терапии', 'ООТ-1, ООТ-3, ООТ-2'),
#  ('Отделение функциональной диагностики', 'ОФД-1, ОФД-2, ОФД-3'),
#  ('Реанимация и интенсивная терапия', 'РИТ-1, РИТ-2, РИТ-3'),
#  ('Токсикологическое отделение', 'ТО-1, ТО-2'),
#  ('Физиотерапевтическое отделение', 'ФО-1, ФО-2, ФО-3')]

# >>> pprint(donations_for_deps)
# [('Неврологическое отделение', Decimal('1188962.36')),
#  ('Кардиологическое отделение', Decimal('4213220.83')),
#  ('Физиотерапевтическое отделение', Decimal('2649853.65')),
#  ('Отделение общей терапии', Decimal('3534930.90')),
#  ('Отделение функциональной диагностики', Decimal('2830049.76')),
#  ('Реанимация и интенсивная терапия', Decimal('2997591.85')),
#  ('Токсикологическое отделение', Decimal('2731081.97'))]

# >>> pprint(donations_for_deps_years)
# [('Кардиологическое отделение', 2015.0, Decimal('1169283.16')),
#  ('Кардиологическое отделение', 2016.0, Decimal('1178578.34')),
#  ('Кардиологическое отделение', 2017.0, Decimal('325788.58')),
#  ('Кардиологическое отделение', 2019.0, Decimal('389866.48')),
#  ('Кардиологическое отделение', 2020.0, Decimal('472223.21')),
#  ('Кардиологическое отделение', 2021.0, Decimal('498697.96')),
#  ('Кардиологическое отделение', 2023.0, Decimal('178783.10')),
#  ('Неврологическое отделение', 2016.0, Decimal('692937.52')),
#  ('Неврологическое отделение', 2019.0, Decimal('397938.77')),
#  ('Неврологическое отделение', 2023.0, Decimal('98086.07')),
#  ('Отделение общей терапии', 2014.0, Decimal('244982.69')),
#  ('Отделение общей терапии', 2016.0, Decimal('673723.94')),
#  ('Отделение общей терапии', 2018.0, Decimal('752236.91')),
#  ('Отделение общей терапии', 2019.0, Decimal('78389.59')),
#  ('Отделение общей терапии', 2021.0, Decimal('727987.14')),
#  ('Отделение общей терапии', 2022.0, Decimal('785393.54')),
#  ('Отделение общей терапии', 2023.0, Decimal('272217.09')),
#  ('Отделение функциональной диагностики', 2015.0, Decimal('573719.19')),
#  ('Отделение функциональной диагностики', 2020.0, Decimal('502013.23')),
#  ('Отделение функциональной диагностики', 2021.0, Decimal('1419751.09')),
#  ('Отделение функциональной диагностики', 2022.0, Decimal('334566.25')),
#  ('Реанимация и интенсивная терапия', 2014.0, Decimal('717971.57')),
#  ('Реанимация и интенсивная терапия', 2015.0, Decimal('402884.81')),
#  ('Реанимация и интенсивная терапия', 2016.0, Decimal('240569.27')),
#  ('Реанимация и интенсивная терапия', 2018.0, Decimal('628292.76')),
#  ('Реанимация и интенсивная терапия', 2021.0, Decimal('278498.69')),
#  ('Реанимация и интенсивная терапия', 2023.0, Decimal('729374.75')),
#  ('Токсикологическое отделение', 2016.0, Decimal('687845.94')),
#  ('Токсикологическое отделение', 2017.0, Decimal('43067.80')),
#  ('Токсикологическое отделение', 2020.0, Decimal('714982.24')),
#  ('Токсикологическое отделение', 2021.0, Decimal('521663.33')),
#  ('Токсикологическое отделение', 2022.0, Decimal('763522.66')),
#  ('Физиотерапевтическое отделение', 2014.0, Decimal('334909.45')),
#  ('Физиотерапевтическое отделение', 2015.0, Decimal('396974.73')),
#  ('Физиотерапевтическое отделение', 2018.0, Decimal('520872.35')),
#  ('Физиотерапевтическое отделение', 2019.0, Decimal('182854.24')),
#  ('Физиотерапевтическое отделение', 2020.0, Decimal('236253.67')),
#  ('Физиотерапевтическое отделение', 2022.0, Decimal('505745.31')),
#  ('Физиотерапевтическое отделение', 2023.0, Decimal('472243.90'))]

# >>> vacation_days_by_weeks
# [('от 1 до 2 недель', 104), ('больше 2 недель', 101), ('до 1 недели', 45)]

