from numpy import array, mean, dot
from numpy import set_printoptions


set_printoptions(suppress=True)

x = array([ 1,   4,   5,   7,  12,  14,  19])
p1 = array([.01, .94, .01, .01, .01, .01, .01])
p2 = array([.01, .01, .01, .01, .01, .01, .94])

# сумма вероятностей
# >>> sum(p1)
# np.float64(1.0)

# среднее арифметическое
# >>> sum(x) / len(x)
# np.float64(8.857142857142858)
# >>>
# >>> mean(x)
# np.float64(8.857142857142858)

# законы распределения
# >>> array([x, p1])
# array([[ 1.  ,  4.  ,  5.  ,  7.  , 12.  , 14.  , 19.  ],
#        [ 0.01,  0.94,  0.01,  0.01,  0.01,  0.01,  0.01]])
# >>>
# >>> array([x, p2])
# array([[ 1.  ,  4.  ,  5.  ,  7.  , 12.  , 14.  , 19.  ],
#        [ 0.01,  0.01,  0.01,  0.01,  0.01,  0.01,  0.94]])

# математическое ожидание
# >>> sum(x[i]*p1[i] for i in range(len(x)))
# np.float64(4.339999999999999)
# >>>
# >>> dot(x, p1)
# np.float64(4.339999999999999)
# >>>
# >>> dot(x, p2)
# np.float64(18.29)

# >>> array([x*10, p2])
# array([[ 10.  ,  40.  ,  50.  ,  70.  , 120.  , 140.  , 190.  ],
#        [  0.01,   0.01,   0.01,   0.01,   0.01,   0.01,   0.94]])
# >>>
# >>> dot(x*10, p2)
# np.float64(182.9)
# >>>
# >>> 10 * dot(x, p2)
# np.float64(182.89999999999998)

