colors = {
    '#000': 'чёрный',
    '#f00': 'красный',
    '#0f0': 'зелёный',
    '#00f': 'синий',
    '#fff': 'белый',
}

# >>> colors
# {'#000': 'чёрный', '#f00': 'красный', '#0f0': 'зелёный', '#00f': 'синий', '#fff': 'белый'}

menu = dict([
    ('борщ', 150), 
    ('солянка', 135), 
    ('том-ям', 180)
])

# >>> menu
# {'борщ': 150, 'солянка': 135, 'том-ям': 180}

menu2 = dict(zip(
    ['борщ', 'солянка', 'том-ям'], 
    (150, 135, 180)
))

# >>> menu2
# {'борщ': 150, 'солянка': 135, 'том-ям': 180}

animal_translations = dict(
    dog='собака',
    cat='кошка',
    fox='лиса'
)

# >>> animal_translations
# {'dog': 'собака', 'cat': 'кошка', 'fox': 'лиса'}

numbers = dict.fromkeys(range(10, 100, 10))

# >>> numbers
# {10: None, 20: None, 30: None, 40: None, 50: None, 60: None, 70: None, 80: None, 90: None}

