mammals = {'кит', 'тигр', 'шимпанзе', 'лошадь', 'дельфин', 'тигр'}
aquatic_list = ['осьминог', 'креветка', 'кит', 'дельфин', 'кальмар', 'кит']
aquatic = set(aquatic_list)

# >>> mammals
# {'тигр', 'шимпанзе', 'кит', 'лошадь', 'дельфин'}
# >>>
# >>> aquatic
# {'кальмар', 'кит', 'дельфин', 'осьминог', 'креветка'}

# >>> mammals | aquatic
# {'лошадь', 'кит', 'шимпанзе', 'креветка', 'осьминог', 'тигр', 'дельфин', 'кальмар'}
# >>>
# >>> mammals & aquatic
# {'кит', 'дельфин'}
# >>>
# >>> mammals - aquatic
# {'шимпанзе', 'лошадь', 'тигр'}
# >>>
# >>> aquatic - mammals
# {'креветка', 'кальмар', 'осьминог'}
# >>>
# >>> mammals ^ aquatic
# {'лошадь', 'тигр', 'креветка', 'кальмар', 'осьминог', 'шимпанзе'}
# >>>
# >>> (mammals | aquatic) - (mammals & aquatic)
# {'лошадь', 'шимпанзе', 'креветка', 'осьминог', 'тигр', 'кальмар'}

reptiles = {'черепаха', 'крокодил', 'змея'}

# >>> mammals.isdisjoint(reptiles)
# True
# >>> reptiles.isdisjoint(mammals)
# True
# >>>
# >>> mammals.isdisjoint(aquatic)
# False

